{
  "homepage": "https://mods.curse.com/mc-mods/minecraft/268495-simple-storage-network",
  "promos": {
    "1.11.2-latest": "1.0.5",
    "1.11.2-recommended": "1.0.5",
    "1.12-latest": "1.0.15",
    "1.12-recommended": "1.0.15",
    "1.12.1-latest": "1.0.15",
    "1.12.1-recommended": "1.1.1",
    "1.12.2-latest": "1.7.1",
    "1.12.2-recommended": "1.7.1"
  },
  "1.11.2":{
	"1.0.0":"First Release"
	,"1.0.1":"JEI integration is now optional, not required dependency. so it will not crash if JEI not installed.  Fixed JEI integration to work with new versions (4.4.x) of JEI.  Added safety checks so if JEI integration fails in future it will simply log error safely and not crash game"
	,"1.0.2":"Fix some keys that are bound to JEI keys not getting passed through to search bar (R/U).  Added new button to clear search bar, mouse click no longer auto clicks search bar.   Several magic strings embedded in code are now in the .lang file for future translators.  "
	,"1.0.3":"Remove some console spam debug messages.  Both remotes now have a 3x3 crafting grid built in.  Remotes now correctly have max stack size one.  Fixed a server crash when something is removed from the network while an import or export node is acting on it.  Fix Export cable no showing its whitelist/blacklist toggle button. "
  	,"1.0.4":"Search bar will now auto focus as soon as the GUI is opened.  Search bar re-focuses when you press the Clear Search (X) button.  Fixed the Import Filter button ignoring the second row of slots.  Add Whitelist/blacklist toggle button to the purple storage link cable.  "
  	,"1.0.5":"Fix compatibility with new JEI versions.  Fix crash with Collossal Chests.  Fix a crash when clicking empty slots in the Export Cable GUI.  Added the Import Filter buttons to the import and export cable GUIs.  "
  },
  "1.12":{   
  	"1.0.5":"Initial port to 1.12, still in alpha state"
  	,"1.0.6":"Update to work with new forge registry system"
  	,"1.0.7":"Fix recipes sometimes being disabled until game restart after a very specific setup (see issue #13 for details). "
  	,"1.0.8":"Fix Master and Request recipes giving out 4 instead of 1.  Fix items sometimes being deleted when using JEI to set a recipe into request table, while also having some items only on your hotbar and not in the network ( issue #16 ).  Search text box will no longer auto-clear its value when using JEI for a recipe and coming back.  "
  	,"1.0.9":"Increase output of upgrade recipes.  Fix Storage Network items sometimes showing up in creative tab of other mods.  Add StorageRemoteRange to config file.  Optimization: cleaned up some code; Removed unused textures and models.  "
 	,"1.0.10":"Fix crash that can sometimes happen when placing down request table"
	,"1.0.11":"Fix item tooltip rendering.  Fix compatibility issue when connecting to Tinkers Construct machines.  Fixed items not rendering in grid and extracting correctly when connected to Storage Drawers.  "
  	,"1.0.12":"Fix items getting deleted when you withdraw them from a network that has zero Storage Drawers.  "
	,"1.0.13":"Fix storage network items bleeding out into other creative tabs.  Tools weapons and armor should ignore damage values when inside import/export cable filters.  "
	,"1.0.14":"You can now right click the search bar to clear text (same result as X button).  JEI toggle moved left so its not covered up and hanging offscreen.  JEI with the network will now correctly find all recipe ingredients if an item is in more than one Ore Dictionary category (such as BTM multiblock wooden parts)."
	,"1.0.15":"Attempt to stop lag spikes and crashes by being more careful around chunk unloading.  Addressed JEI recipe finder useing the wrong ore-dictionary item (such as getting the wrong colour of dye / getting lapis instead of inc sacks).   Compatible with Minecraft 1.12.2.  Minimum forge version is now 14.22.0.2464.  Updated JEI compatibility to 4.7.8.92. "
  },
  "1.12.1":{
	"1.0.13":"Fix storage network items bleeding out into other creative tabs.  Tools weapons and armor should ignore damage values when inside import/export cable filters.  "
	,"1.0.14":"You can now right click the search bar to clear text (same result as X button).  JEI toggle moved left so its not covered up and hanging offscreen.  JEI with the network will now correctly find all recipe ingredients if an item is in more than one Ore Dictionary category (such as BTM multiblock wooden parts)."
	,"1.0.15":"Attempt to stop lag spikes and crashes by being more careful around chunk unloading.  Addressed JEI recipe finder useing the wrong ore-dictionary item (such as getting the wrong colour of dye / getting lapis instead of inc sacks).   Compatible with Minecraft 1.12.2.  Minimum forge version is now 14.22.0.2464.  Updated JEI compatibility to 4.7.8.92. "
  	,"1.1.0":"You can now shift-click the upgrade items in an out of the four upgrade slots in the import/export cables.  Added two checkboxes to import and export cables: one to toggle matching metadata and one to toggle matching on the ore dictionary.  The export cable does not have a blacklist mode, only whitelist, so I removed the deceptive toggle button.  Optimized imports and export code.  Moved some hardcoded text out into the .lang files."
  	,"1.1.1":"If you drop or move the remote away while holding it with the GUI screen open, it will now just close instead of crashing. ."
  },
  "1.12.2":{
	"1.0.15":"Attempt to stop lag spikes and crashes by being more careful around chunk unloading.  Addressed JEI recipe finder useing the wrong ore-dictionary item (such as getting the wrong colour of dye / getting lapis instead of inc sacks).   Compatible with Minecraft 1.12.2.  Minimum forge version is now 14.22.0.2464.  Updated JEI compatibility to 4.7.8.92. "
 	,"1.1.0":"You can now shift-click the upgrade items in an out of the four upgrade slots in the import/export cables.  Added two checkboxes to import and export cables: one to toggle matching metadata and one to toggle matching on the ore dictionary.  The export cable does not have a blacklist mode, only whitelist, so I removed the deceptive toggle button.  Optimized imports and export code.  Moved some hardcoded text out into the .lang files."
	,"1.1.1":"If you drop or move the remote away while holding it with the GUI screen open, it will now just close instead of crashing. ."
	,"1.2.0":"Minimum forge version 14.23.0.2494.  Fixed Network packet too large crash when crafting recipes on large networks & modpacks with many recipes.  Storage Link Cable now has a GUI with Priority system and the whitelist/blacklist filter slots.  Also there is a new button that is only for Storage Link Cable GUI that allows you to set the connection as Output Only, meaning it will withdraw but not insert.  Tooltips now no longer hide behind the JEI screen.  Fix missing tooltip for Sort Direction button.  Fixed a bug to make sure cable upgrades now get dropped on the ground when the cable is broken.  Tightened up bounding box on the Storage Cable so it matches the model.  Improved performance and reduced some excess refresh calls (so crafting items and refreshing the grid are not as tightly coupled anymore).  Fixed the storage network from locking up the whole game when you are shift-click crafting (this was only noticeable in large modpacks with many many recipes, caused by a new recipe lookup search in each recipe iteration).  New config has been added to turn on benchmark logging in case future problems need to be detected, off by default. "
	,"1.2.1":"Fixed item loss bug related to shift-click crafting (was introduced in latest update 1.2.0, in newer forge versions).  "
	,"1.2.2":"Fixed exceptions thrown to log when connecting to some modded blocks (Thermal expansion).  New config option ReloadNetworkWhenUnloadChunk that you can disable if your server has any chunk loading issues.  "
	,"1.2.3":"Fixed item dupe bug occurring with certain special case recipes.  "
	,"1.2.4":"Stack Upgrade now increases import/export size to a full stack (from 4 to 64 where previously it was from 4 to 8).  Upgrade Items now stack to 64 when outside of a cable.  Fixed and improved the power of the Speed Upgrade.  "
  	,"1.2.5":"Requires forge version 14.23.1.2594 or higher.  Fixed item loss when using extractor cables along with speed upgrades.  Fixed crafting using the network from sometimes dropping NBT data from result (such as Iron Backpacks, Silents Gems).  "
	,"1.2.6":"Fixed the network sometimes not giving out items with null or Zero NBT tags and cleaned up some old logic.  "
  	,"1.2.7":"Fixed the lag of several seconds when you first open a network inventory, it is now nearly instant."
  	,"1.2.8":"Suggested minimum forge version 14.23.4.2705.  Suggested minimum JEI version 4.10.0.199 (mod is optional).  Fixed ore dictionary issue when JEI is adding a recipe to the grid and not finding matching items (example: different types of tin ore, or different types of wood planks).  Textbox JEI sync now works differently: it only updates JEI text on a keypress and not every tick; when you initially open the screen it reads in your current JEI search instead of wiping it.  Changed default recipes of Remotes.  Fixed some NBT based recipes not crafting when using shift-click (such as Preston compressed blocks).  If a recipe is used that tries to create an empty item stack, it will now log an error safely instead of consuming ingredients and giving the player nothing.  "
	,"1.2.9":"New mid-tier remote called Upgraded Remote, it only works within the same dimension as the network but it is still unlimited range. "
  	,"1.3.0":"Added error handling for the 'dsi.fastutil' error so the game will not crash when mass-crafting some recipes.  ru_RU.lang added by kellixon.  Optimized TileEntity scanning when processing imports and exports.  Fixed shift-click errors out of the crafting grid in request table.   Removed the mostly broken 'smallFont' config.  Fixed compatibility with JEI 4.12.0.215+.  Fixed crafting issues with some modded items that take damage while crafting (Mystical Agriculture and others).  Hold SHIFT in network inventory to see precise amounts instead of short form (2k).  JEI recipe and uses keybinds now compatible with network inventory (only if text box is un-focused).  ItemSlot filters in cables no longer sometimes randomly vanish when you initially place them.  Cable filters stop you from adding duplicate items.  Fixed shift-clicking upgrades in the cable GUI going wonky.  Fixed Cable upgrade items sometimes getting deleted.  "
	,"1.4.0":"Insert and Import logic rewritten and optimized for less lag (caches recent inserts so new items can shortcut and know where to go).  FastWorkbench integration added by shadows_on_fire, which greatly removes the lag when shift-clicking recipes in large networks  (requires FastWorkbench to be installed).  Fences no longer connect to cables.  Fixed some large numbers not rounding evenly on display.  Tooltip to show that lower Priority items should go first.  Rotate existing connected Link Cables (using wrenches/abilities from various mods) will now refresh its connection properly in the new direction, or keep the old direction if invalid.  Catch an uncommon crash when remote is opened and cant find attached network.  Fixed uncommon render crash while rendering button tooltips.  Fixed a crash when playing on a server and using ItemRemote after a chunk reload.    "
	,"1.5.0":"New blocks: Processing Cable and Controller.  Fixed Storage cables not using priority.  Added ore and meta checkboxes to Storage cables.  Fixed a bug that would delete items when you clicked the Import Filter button.  "
  	,"1.5.1":"Fix a startup crash introduced in 1.5.0.  When a processing cable gets sent a nonzero request when it was stuck at zero, it switches modes to avoid the bug where it needs a manual restart (R button).    "
  	,"1.5.2":"Fix issue where priority was sometimes ignored due to an error in some optimization features.  "
  	,"1.5.3":"Processing cable now allows you to put the same item on both the left and right side.  Added NBT checkbox for filtering items in cables.  Fixed a game crash where network tried to get ore-dictionary data on empty item stacks.  Fix the game sometimes crashing if JEI is not installed.  Fixed a bug where shift-crafting multiple stacks in the remote could consume too many items.  "
	,"1.5.4":"Fixed Storage Remote sometimes not opening and getting locked up.  "
	,"1.5.5":"Processing cable now indicates if its recipe is invalid to the player.  Updated priority tooltip.  Fixed delay in processing cables (it no longer looks for impossible speed upgrades).  Update to recipe handler transfer from JEI to avoid getting mismatched NBT items (such as tools or copper cables). "
  	,"1.5.6":"Fixed Controller not listing correct block name for some machines (Mekanism, exu2).  New config S:BlacklistBlocks added to disable connections to any block, default value contains extrautils2:playerchest.  Removed a debug button that did nothing.  Added scroll-wheel support to certain filter and recipe slots in network cable inventories.  "
  	,"1.5.7":"Fixed an issue where item stacks would appear and be extracted even when the machine set those slots to disable extraction (for example machine upgrades if the mod had the right setting in IItemHandler:extractItem).  "
  	,"1.6.0":"Api and huge refactor using capabilities with thraaawn.  "
  	,"1.6.1":"Fixed network GUI's not opening.  Addon capability API in 1.6.0 is available for use.  "
  	,"1.6.2":"Added safeguards to patch ConcurrentModificationException with processing cables.  Fixed the remotes sometimes crashing the game.   "
  	,"1.6.3":"Fix a game crash when the network was large and was refreshing connections (such as player dying, etc)"
  	,"1.6.4":"Fixed game crash when network refreshed itself multiple times on the same tick (Thanks Davenonymous aka thraaawn). "
  	,"1.6.5":"Fixed a rare game crash that can happen when, if fastcraft is installed, and if chunk the master was in was unloaded (coming back from nether, etc) then this can happen when you come back if you open a network GUI before it can refresh."
  	,"1.6.6":"Fixed a bug where the came might crash when playing on a server and using the network across dimensions.  "
  	,"1.7.0":"Added simple remote with no crafting component.  Updated to work around some small server issues and crafting issues.  Add config to optionally disable fastworkbench compatibility even if mod is installed for testing.   "
  	,"1.7.1":"Tooltip fix"
  }
}
