{
  "homepage": "https://mods.curse.com/mc-mods/minecraft/268495-simple-storage-network",
  "promos": {
    "1.11.2-latest": "1.0.5",
    "1.11.2-recommended": "1.0.5",
    "1.12-latest": "1.0.11",
    "1.12-recommended": "1.0.11"
  },
  "1.11.2":{
	"1.0.0":"First Release"
	,"1.0.1":"JEI integration is now optional, not required dependency. so it will not crash if JEI not installed.  Fixed JEI integration to work with new versions (4.4.x) of JEI.  Added safety checks so if JEI integration fails in future it will simply log error safely and not crash game"
	,"1.0.2":"Fix some keys that are bound to JEI keys not getting passed through to search bar (R/U).  Added new button to clear search bar, mouse click no longer auto clicks search bar.   Several magic strings embedded in code are now in the .lang file for future translators.  "
	,"1.0.3":"Remove some console spam debug messages.  Both remotes now have a 3x3 crafting grid built in.  Remotes now correctly have max stack size one.  Fixed a server crash when something is removed from the network while an import or export node is acting on it.  Fix Export cable no showing its whitelist/blacklist toggle button. "
  	,"1.0.4":"Search bar will now auto focus as soon as the GUI is opened.  Search bar re-focuses when you press the Clear Search (X) button.  Fixed the Import Filter button ignoring the second row of slots.  Add Whitelist/blacklist toggle button to the purple storage link cable.  "
  	,"1.0.5":"Fix compatibility with new JEI versions.  Fix crash with Collossal Chests.  Fix a crash when clicking empty slots in the Export Cable GUI.  Added the Import Filter buttons to the import and export cable GUIs.  "
  },
  "1.12":{   
  	"1.0.5":"Initial port to 1.12, still in alpha state"
  	,"1.0.6":"Update to work with new forge registry system"
  	,"1.0.7":"Fix recipes sometimes being disabled until game restart after a very specific setup (see issue #13 for details). "
  	,"1.0.8":"Fix Master and Request recipes giving out 4 instead of 1.  Fix items sometimes being deleted when using JEI to set a recipe into request table, while also having some items only on your hotbar and not in the network ( issue #16 ).  Search text box will no longer auto-clear its value when using JEI for a recipe and coming back.  "
  	,"1.0.9":"Increase output of upgrade recipes.  Fix Storage Network items sometimes showing up in creative tab of other mods.  Add StorageRemoteRange to config file.  Optimization: cleaned up some code; Removed unused textures and models.  "
 	,"1.0.10":"Fix crash that can sometimes happen when placing down request table"
	,"1.0.11":"Fix item tooltip rendering.  "
  } 
}
